source/_static/diagrams/43-compile-or-run-only.d2
direction: right
n0: "sources"
n1: "compile"
n2: "run-only"
n0 -> n1
n1 -> n2
